#!/bin/bash

# ------------------------------------------------------- #
# ログ管理
# ------------------------------------------------------- #
source ./util/log_manager.sh

# ------------------------------------------------------- #
# 引数チェック
# ------------------------------------------------------- #
if [ $# != 2 ]; then
    echo 引数エラー: $* 1>&2
    exit 1
fi

# ------------------------------------------------------- #
# 変数定義
# ------------------------------------------------------- #
export SYSTEM_NAME=$1
export ENV_NAME=$2
export STACK_LIST=./stack-list

# ------------------------------------------------------- #
# 関数インポート
# ------------------------------------------------------- #
source ./util/delete_stack.sh
source ./util/put_containerInsights.sh

# ------------------------------------------------------- #
# Main
# ------------------------------------------------------- #
# 説明：
# stack-listの下から順にスタックを削除する
# ------------------------------------------------------- #
for line in `echo "$(cat ${STACK_LIST})" | tac`
do
  if [ $line = "07-ecs" ] ; then
    # 07-ecsスタック削除前の特別処理
    put_containerInsights 2
  fi

  # スタック削除
  delete_stack $line
done

exit